DATA FRAME

In [5]:
import pandas as pd

# menggunakan list

data = [
    [12,3],
    [13,14],
    [15,16]
]

df = pd.DataFrame(data)
df

    0   1
0  12   3
1  13  14
2  15  16

In [6]:
# menggunakan dictionary

data = {
    "nama" : ["agung", "emi", "william"],
    "umur" : [20, 25, 20],
    "alamat" : ["denpasar", "gianyar", "surabaya"]
}

df = pd.DataFrame(data)
df

      nama  umur    alamat
0    agung    20  denpasar
1      emi    25   gianyar
2  william    20  surabaya

In [7]:
df.index = [1,2,3]
df

      nama  umur    alamat
1    agung    20  denpasar
2      emi    25   gianyar
3  william    20  surabaya

In [8]:
df.columns = ["name", "age", "addres"]
df

      name  age    addres
1    agung   20  denpasar
2      emi   25   gianyar
3  william   20  surabaya

In [ ]:
df["name"] # memanggil dengan series

1      agung
2        emi
3    william
Name: name, dtype: object

In [ ]:
df.loc[1] # memanggil baris 1

name         agung
age             20
addres    denpasar
Name: 1, dtype: object

In [11]:
df.loc[1:3]

      name  age    addres
1    agung   20  denpasar
2      emi   25   gianyar
3  william   20  surabaya

In [ ]:
df.loc[1:3, "name" : "age"] # [baris, kolom]

      name  age
1    agung   20
2      emi   25
3  william   20

In [13]:
df.iloc[0]

name         agung
age             20
addres    denpasar
Name: 1, dtype: object

In [14]:
df.iloc[0 : 3]

      name  age    addres
1    agung   20  denpasar
2      emi   25   gianyar
3  william   20  surabaya

In [16]:
df.iloc[0:2]

    name  age    addres
1  agung   20  denpasar
2    emi   25   gianyar

In [17]:
df.iloc[0:2, 0:2]

    name  age
1  agung   20
2    emi   25

ASSIGNMENT

In [23]:
data = {
    "Athletes" : ["Michael Phelps", "Michael Phelps", "Michael Phelps", "Natalie Coughlin", "Aleksey Nemov"],
    "Age" : [23, 19, 27, 25,24],
    "Country" : ["United States", "Canada", "United States", "Norway", "China"],
    "Year" : [2008, 2004, 2012, 2008, 2000],
    "Gold Medals" : [8, 6, 4, 1, 2] 
}

df = pd.DataFrame(data)
df

           Athletes  Age        Country  Year  Gold Medals
0    Michael Phelps   23  United States  2008            8
1    Michael Phelps   19         Canada  2004            6
2    Michael Phelps   27  United States  2012            4
3  Natalie Coughlin   25         Norway  2008            1
4     Aleksey Nemov   24          China  2000            2

In [20]:
df.columns

Index(['Athlete', 'Age', 'Country', 'Year', 'Gold Medals'], dtype='object')

In [24]:
df.loc[1:4, "Athletes" : "Year"]

           Athletes  Age        Country  Year
1    Michael Phelps   19         Canada  2004
2    Michael Phelps   27  United States  2012
3  Natalie Coughlin   25         Norway  2008
4     Aleksey Nemov   24          China  2000

In [26]:
df.loc[0:, "Athletes"]

0      Michael Phelps
1      Michael Phelps
2      Michael Phelps
3    Natalie Coughlin
4       Aleksey Nemov
Name: Athletes, dtype: object

In [31]:
df.loc[0:, "Country"]

0    United States
1           Canada
2    United States
3           Norway
4            China
Name: Country, dtype: object

In [32]:
df.loc[0:, "Year"]

0    2008
1    2004
2    2012
3    2008
4    2000
Name: Year, dtype: int64

In [36]:
df.loc[0:2, "Athletes" : "Gold Medals"]

         Athletes  Age        Country  Year  Gold Medals
0  Michael Phelps   23  United States  2008            8
1  Michael Phelps   19         Canada  2004            6
2  Michael Phelps   27  United States  2012            4

DATA FRAME CONDITIONAL

In [37]:
data = {
    "nama" : ["agung", "emi", "william", "fafa"],
    "umur" : [20, 25, 20, 19],
    "alamat" : ["denpasar", "gianyar", "surabaya", "denpasar"]
}

df = pd.DataFrame(data)
df

      nama  umur    alamat
0    agung    20  denpasar
1      emi    25   gianyar
2  william    20  surabaya
3     fafa    19  denpasar

In [38]:
df["umur"]

0    20
1    25
2    20
3    19
Name: umur, dtype: int64

In [39]:
df["umur"] > 19

0     True
1     True
2     True
3    False
Name: umur, dtype: bool

In [40]:
df.loc[df["umur"] > 19]

      nama  umur    alamat
0    agung    20  denpasar
1      emi    25   gianyar
2  william    20  surabaya

In [41]:
df.loc[df["umur"] > 19, "alamat"]

0    denpasar
1     gianyar
2    surabaya
Name: alamat, dtype: object

In [42]:
df.loc[df["umur"] > 19, ["umur", "alamat"]]

   umur    alamat
0    20  denpasar
1    25   gianyar
2    20  surabaya

In [43]:
df.loc[(df["umur"] > 19) & (df["umur"] < 25)]

      nama  umur    alamat
0    agung    20  denpasar
2  william    20  surabaya

In [44]:
df

      nama  umur    alamat
0    agung    20  denpasar
1      emi    25   gianyar
2  william    20  surabaya
3     fafa    19  denpasar

In [ ]:
df.drop(3) # menghapus index

      nama  umur    alamat
0    agung    20  denpasar
1      emi    25   gianyar
2  william    20  surabaya

In [66]:
data = {
    "nama" : ["agung", "emi", "william", "fafa"],
    "umur" : [20, 25, 20, 19],
    "alamat" : ["denpasar", "gianyar", "surabaya", "denpasar"]
}

df = pd.DataFrame(data)
df

      nama  umur    alamat
0    agung    20  denpasar
1      emi    25   gianyar
2  william    20  surabaya
3     fafa    19  denpasar

In [51]:
df

      nama  umur    alamat
0    agung    20  denpasar
1      emi    25   gianyar
2  william    20  surabaya
3     fafa    19  denpasar

In [ ]:
df.drop(3, inplace=True) # cara 1, mengubah inti index

# df = df.drop(3) # cara 2

In [53]:
df

      nama  umur    alamat
0    agung    20  denpasar
1      emi    25   gianyar
2  william    20  surabaya

In [59]:
df.drop([0,2], inplace=True)

In [60]:
df

   nama  umur    alamat
1   emi    25   gianyar
3  fafa    19  denpasar

In [65]:
df.drop(columns = ["nama", "umur"], inplace=True)
df

     alamat
0  denpasar
1   gianyar
2  surabaya
3  denpasar

In [67]:
df["gaji"] = [1000, 2000, 3000, 4000]
df

      nama  umur    alamat  gaji
0    agung    20  denpasar  1000
1      emi    25   gianyar  2000
2  william    20  surabaya  3000
3     fafa    19  denpasar  4000

In [69]:
df["total gaji"] = df["umur"] * df["gaji"]
df

      nama  umur    alamat  gaji  total gaji
0    agung    20  denpasar  1000       20000
1      emi    25   gianyar  2000       50000
2  william    20  surabaya  3000       60000
3     fafa    19  denpasar  4000       76000

In [70]:
df["total gaji"] = df["total gaji"] - 500
df

      nama  umur    alamat  gaji  total gaji
0    agung    20  denpasar  1000       19500
1      emi    25   gianyar  2000       49500
2  william    20  surabaya  3000       59500
3     fafa    19  denpasar  4000       75500

In [73]:
df.rename(
    columns = {
        "nama" : "name",
        "umur" : "age",
        "alamat" : "address",
        "gaji" : "salary",
        "total gaji" : "total salary"
    }, inplace = True
)

df

      name  age   address  salary  total salary
0    agung   20  denpasar    1000         19500
1      emi   25   gianyar    2000         49500
2  william   20  surabaya    3000         59500
3     fafa   19  denpasar    4000         75500

In [76]:
df["name"].replace("fafa", "fufu", inplace=True)
df

      name  age   address  salary  total salary
0    agung   20  denpasar    1000         19500
1      emi   25   gianyar    2000         49500
2  william   20  surabaya    3000         59500
3     fufu   19  denpasar    4000         75500

In [79]:
df["address"].replace(["denpasar", "surabaya"], ["bangli", "jakarta"], inplace=True)
df

C:\Users\HP\AppData\Local\Temp\ipykernel_5420\1596156193.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["address"].replace(["denpasar", "surabaya"], ["bangli", "jakarta"], inplace=True)

      name  age  address  salary  total salary
0    agung   20   bangli    1000         19500
1      emi   25  gianyar    2000         49500
2  william   20  jakarta    3000         59500
3     fufu   19   bangli    4000         75500

ASSIGNMENT

In [99]:
data = {
    "Athletes" : ["Michael Phelps", "Michael Phelps", "Michael Phelps", "Natalie Coughlin", "Aleksey Nemov"],
    "Age" : [23, 19, 27, 25,24],
    "Country" : ["United States", "Canada", "United States", "Norway", "China"],
    "Year" : [2008, 2004, 2012, 2008, 2000],
    "Gold Medals" : [8, 6, 4, 1, 2] 
}

df = pd.DataFrame(data)
df

           Athletes  Age        Country  Year  Gold Medals
0    Michael Phelps   23  United States  2008            8
1    Michael Phelps   19         Canada  2004            6
2    Michael Phelps   27  United States  2012            4
3  Natalie Coughlin   25         Norway  2008            1
4     Aleksey Nemov   24          China  2000            2

In [94]:
df.loc[df["Country"] == "United States", "Athletes"]

0    Michael Phelps
2    Michael Phelps
Name: Athletes, dtype: object

In [97]:
df.loc[df["Year"] == 2008, "Athletes"]

0      Michael Phelps
3    Natalie Coughlin
Name: Athletes, dtype: object

In [104]:
data = df.loc[(df["Age"] >= 25) & (df["Country"] == "Norway")]
data.index
df.drop(data.index, inplace = True)

In [105]:
df

         Athletes  Age        Country  Year  Gold Medals
0  Michael Phelps   23  United States  2008            8
1  Michael Phelps   19         Canada  2004            6
2  Michael Phelps   27  United States  2012            4
4   Aleksey Nemov   24          China  2000            2

In [106]:
df["Silver Medal"] = [0,0,2,1]
df["Bronze Medal"] = [0,2,0,3]
df

,Athletes,Age,Country,Year,Gold Medals,Silver Medal,Bronze Medal
0,Michael Phelps,23,United States,2008,8,0,0
1,Michael Phelps,19,Canada,2004,6,0,2
2,Michael Phelps,27,United States,2012,4,2,0
4,Aleksey Nemov,24,China,2000,2,1,3

READING EXTERNAL DATA

In [112]:
data = pd.read_csv("covid19.csv", header = None)
data.drop(0, inplace=True)
data.columns = ["Tanggal", "ODP", "PDP", "Kasus Positif", "Kasus Sembuh", "Kasus Meninggal"]
data

      Tanggal  ODP  PDP Kasus Positif Kasus Sembuh Kasus Meninggal
1   3/26/2020  204   89            17            0               4
2   3/27/2020  207   99            17            0               4
3   3/29/2020  256  119            28            0               4
4   3/30/2020  262  123            31            0               6
5   3/31/2020  308  134            34            2               6
6    4/1/2020  336  139            38            2               6
7    4/2/2020  371  156            40            2              10
8    4/5/2020  416  170            42            2              10
9    4/6/2020  450  184            43            2              11
10   4/8/2020  525  196            44            2              13
11  4/11/2020  600  230            47            2              15
12  4/12/2020  606  231            49            2              16
13  4/13/2020  630  239            50            3              16
14  4/14/2020  629  245            44            9              16

In [113]:
data.shape

(14, 6)

In [114]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 1 to 14
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Tanggal          14 non-null     object
 1   ODP              14 non-null     object
 2   PDP              14 non-null     object
 3   Kasus Positif    14 non-null     object
 4   Kasus Sembuh     14 non-null     object
 5   Kasus Meninggal  14 non-null     object
dtypes: object(6)
memory usage: 804.0+ bytes

In [115]:
data.head()

     Tanggal  ODP  PDP Kasus Positif Kasus Sembuh Kasus Meninggal
1  3/26/2020  204   89            17            0               4
2  3/27/2020  207   99            17            0               4
3  3/29/2020  256  119            28            0               4
4  3/30/2020  262  123            31            0               6
5  3/31/2020  308  134            34            2               6

In [116]:
data.head(10)

      Tanggal  ODP  PDP Kasus Positif Kasus Sembuh Kasus Meninggal
1   3/26/2020  204   89            17            0               4
2   3/27/2020  207   99            17            0               4
3   3/29/2020  256  119            28            0               4
4   3/30/2020  262  123            31            0               6
5   3/31/2020  308  134            34            2               6
6    4/1/2020  336  139            38            2               6
7    4/2/2020  371  156            40            2              10
8    4/5/2020  416  170            42            2              10
9    4/6/2020  450  184            43            2              11
10   4/8/2020  525  196            44            2              13

In [117]:
data.tail()

      Tanggal  ODP  PDP Kasus Positif Kasus Sembuh Kasus Meninggal
10   4/8/2020  525  196            44            2              13
11  4/11/2020  600  230            47            2              15
12  4/12/2020  606  231            49            2              16
13  4/13/2020  630  239            50            3              16
14  4/14/2020  629  245            44            9              16

In [120]:
data.tail(10)

      Tanggal  ODP  PDP Kasus Positif Kasus Sembuh Kasus Meninggal
5   3/31/2020  308  134            34            2               6
6    4/1/2020  336  139            38            2               6
7    4/2/2020  371  156            40            2              10
8    4/5/2020  416  170            42            2              10
9    4/6/2020  450  184            43            2              11
10   4/8/2020  525  196            44            2              13
11  4/11/2020  600  230            47            2              15
12  4/12/2020  606  231            49            2              16
13  4/13/2020  630  239            50            3              16
14  4/14/2020  629  245            44            9              16